testCases/Cavity/Hanhoun/non-ideality-comparison/cavity_stoich_MAPST_noGamma/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermo    bhuiyanCorrelation<liquidReactionThermo>;

speciesThermoFile    "$FOAM_CASE/constant/thermo.liquid";

inertSpecie H2O;

cell    0;


// ************************************************************************* //
